## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization  | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

_**Hint:** If "Terraform Format & Style" failed, run `terraform fmt -recursive` from the `terraform/` directory and commit the results._

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.api.aws_ecs_task_definition.default[0] has changed
  ~ resource "aws_ecs_task_definition" "default" {
        id                       = "gost-staging-api"
+       tags                     = {}
        # (13 unchanged attributes hidden)

+       volume {
+           name = "data"

+           efs_volume_configuration {
+               file_system_id          = "fs-08f95063c1cdbe191"
+               root_directory          = "/"
+               transit_encryption      = "ENABLED"
+               transit_encryption_port = 0

+               authorization_config {
+                   access_point_id = "fsap-03bc0296928aade4f"
                }
            }
        }
-       volume {
-           name = "data" -> null

-           efs_volume_configuration {
-               file_system_id     = "fs-08f95063c1cdbe191" -> null
-               root_directory     = "/" -> null
-               transit_encryption = "ENABLED" -> null

-               authorization_config {
-                   access_point_id = "fsap-03bc0296928aade4f" -> null
                }
            }
        }

        # (1 unchanged block hidden)
    }

  # module.api.aws_iam_role.task[0] has changed
  ~ resource "aws_iam_role" "task" {
        id                    = "gost-staging-api-ECSTask-2023021701041477300000000a"
        name                  = "gost-staging-api-ECSTask-2023021701041477300000000a"
      ~ role_last_used        = [
          ~ {
              ~ last_used_date = "2024-03-22T21:15:13Z" -> "2024-03-22T21:38:39Z"
                # (1 unchanged element hidden)
            },
        ]
        tags                  = {}
        # (11 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-   destroy
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.publish_to_digest_email_get_grants will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "publish_to_digest_email_get_grants" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "sqs:SendMessage",
            ]
+           resources = [
+               (known after apply),
            ]
+           sid       = "AllowPublishToQueue"
        }
    }

  # data.aws_iam_policy_document.publish_to_digest_email_send_queue will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "publish_to_digest_email_send_queue" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "sqs:SendMessage",
            ]
+           resources = [
+               (known after apply),
            ]
+           sid       = "AllowPublishToQueue"
        }
    }

  # aws_iam_role_policy.digest_email_get_grants-publish_to_digest_email_send_queue will be created
+   resource "aws_iam_role_policy" "digest_email_get_grants-publish_to_digest_email_send_queue" {
+       id          = (known after apply)
+       name        = (known after apply)
+       name_prefix = "send-digest-email-send-requests"
+       policy      = (known after apply)
+       role        = (known after apply)
    }

  # aws_iam_role_policy.digest_email_kickoff_cron-publish_to_digest_email_get_grants_queue will be created
+   resource "aws_iam_role_policy" "digest_email_kickoff_cron-publish_to_digest_email_get_grants_queue" {
+       id          = (known after apply)
+       name        = (known after apply)
+       name_prefix = "send-digest-email-get-grants-requests"
+       policy      = (known after apply)
+       role        = "gost-staging-api-ECSTask-2023021701041477300000000a"
    }

  # module.api.aws_ecs_service.default[0] will be updated in-place
  ~ resource "aws_ecs_service" "default" {
        id                                 = "arn:aws:ecs:us-west-2:357150818708:service/gost-staging/gost-staging-api"
        name                               = "gost-staging-api"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:357150818708:task-definition/gost-staging-api:191" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.api.aws_ecs_task_definition.default[0] must be replaced
+/- resource "aws_ecs_task_definition" "default" {
      ~ arn                      = "arn:aws:ecs:us-west-2:357150818708:task-definition/gost-staging-api:191" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:357150818708:task-definition/gost-staging-api" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                  ~ dockerLabels           = {
                      ~ "com.datadoghq.tags.version" = "1ed9b2c9eefa3d91508bdb7c11d1d85396394ff3" -> "ff416731f461a59136b2e4cb261e0506b7b1c168"
                        # (2 unchanged elements hidden)
                    }
                  ~ environment            = [
                        # (7 unchanged elements hidden)
                        {
                            name  = "DD_SERVICE"
                            value = "gost"
                        },
                      ~ {
                            name  = "DD_VERSION"
                          ~ value = "1ed9b2c9eefa3d91508bdb7c11d1d85396394ff3" -> "ff416731f461a59136b2e4cb261e0506b7b1c168"
                        },
                        {
                            name  = "ENABLE_GRANTS_DIGEST"
                            value = "false"
                        },
                        # (12 unchanged elements hidden)
                    ]
                  ~ image                  = "ghcr.io/usdigitalresponse/usdr-gost-api:1ed9b2c9eefa3d91508bdb7c11d1d85396394ff3@sha256:0167ef9b1ac45c883ef990e622d559e1ad7050433e7d71a27ab477951cf011f3" -> "ghcr.io/usdigitalresponse/usdr-gost-api:ff416731f461a59136b2e4cb261e0506b7b1c168@sha256:1eeaf41fbdab316509f84236bfaeb9172c0008258178fa44e57cdfb71d02d8b6"
                    name                   = "api"
-                   systemControls         = [] -> null
-                   volumesFrom            = [] -> null
                    # (9 unchanged elements hidden)
                } # forces replacement,
              ~ {
                  ~ dockerLabels           = {
                      ~ "com.datadoghq.tags.version" = "1ed9b2c9eefa3d91508bdb7c11d1d85396394ff3" -> "ff416731f461a59136b2e4cb261e0506b7b1c168"
                        # (2 unchanged elements hidden)
                    }
                  ~ environment            = [
                        # (3 unchanged elements hidden)
                        {
                            name  = "DD_SERVICE"
                            value = "gost"
                        },
                      ~ {
                            name  = "DD_VERSION"
                          ~ value = "1ed9b2c9eefa3d91508bdb7c11d1d85396394ff3" -> "ff416731f461a59136b2e4cb261e0506b7b1c168"
                        },
                        {
                            name  = "ECS_FARGATE"
                            value = "true"
                        },
                    ]
-                   mountPoints            = [] -> null
                    name                   = "datadog"
-                   portMappings           = [] -> null
-                   systemControls         = [] -> null
-                   volumesFrom            = [] -> null
                    # (6 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ id                       = "gost-staging-api" -> (known after apply)
      ~ revision                 = 191 -> (known after apply)
-       tags                     = {} -> null
        # (9 unchanged attributes hidden)

-       volume {
-           name = "data" -> null

-           efs_volume_configuration {
-               file_system_id          = "fs-08f95063c1cdbe191" -> null
-               root_directory          = "/" -> null
-               transit_encryption      = "ENABLED" -> null
-               transit_encryption_port = 0 -> null

-               authorization_config {
-                   access_point_id = "fsap-03bc0296928aade4f" -> null
                }
            }
        }
+       volume {
+           name = "data"

+           efs_volume_configuration {
+               file_system_id     = "fs-08f95063c1cdbe191"
+               root_directory     = "/"
+               transit_encryption = "ENABLED"

+               authorization_config {
+                   access_point_id = "fsap-03bc0296928aade4f"
                }
            }
        }

        # (1 unchanged block hidden)
    }

  # module.arpa_audit_report.aws_ecs_service.default will be updated in-place
  ~ resource "aws_ecs_service" "default" {
        id                                 = "arn:aws:ecs:us-west-2:357150818708:service/gost-staging/gost-staging-arpa_audit_report"
        name                               = "gost-staging-arpa_audit_report"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:357150818708:task-definition/gost-staging-arpa_audit_report:160" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.arpa_audit_report.aws_ecs_task_definition.consumer must be replaced
+/- resource "aws_ecs_task_definition" "consumer" {
      ~ arn                      = "arn:aws:ecs:us-west-2:357150818708:task-definition/gost-staging-arpa_audit_report:160" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:357150818708:task-definition/gost-staging-arpa_audit_report" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ id                       = "gost-staging-arpa_audit_report" -> (known after apply)
-       ipc_mode                 = "" -> null
-       pid_mode                 = "" -> null
      ~ revision                 = 160 -> (known after apply)
-       tags                     = {} -> null
        # (9 unchanged attributes hidden)

-       volume {
-           name = "data" -> null

-           efs_volume_configuration {
-               file_system_id          = "fs-08f95063c1cdbe191" -> null
-               root_directory          = "/" -> null
-               transit_encryption      = "ENABLED" -> null
-               transit_encryption_port = 0 -> null

-               authorization_config {
-                   access_point_id = "fsap-03bc0296928aade4f" -> null
                }
            }
        }
+       volume {
+           name = "data"

+           efs_volume_configuration {
+               file_system_id     = "fs-08f95063c1cdbe191"
+               root_directory     = "/"
+               transit_encryption = "ENABLED"

+               authorization_config {
+                   access_point_id = "fsap-03bc0296928aade4f"
                }
            }
        }

        # (1 unchanged block hidden)
    }

  # module.arpa_treasury_report.aws_ecs_service.default will be updated in-place
  ~ resource "aws_ecs_service" "default" {
        id                                 = "arn:aws:ecs:us-west-2:357150818708:service/gost-staging/gost-staging-treasury_report"
        name                               = "gost-staging-treasury_report"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:357150818708:task-definition/gost-staging-treasury_report:149" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.arpa_treasury_report.aws_ecs_task_definition.consumer must be replaced
+/- resource "aws_ecs_task_definition" "consumer" {
      ~ arn                      = "arn:aws:ecs:us-west-2:357150818708:task-definition/gost-staging-treasury_report:149" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:357150818708:task-definition/gost-staging-treasury_report" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ id                       = "gost-staging-treasury_report" -> (known after apply)
-       ipc_mode                 = "" -> null
-       pid_mode                 = "" -> null
      ~ revision                 = 149 -> (known after apply)
-       tags                     = {} -> null
        # (9 unchanged attributes hidden)

-       volume {
-           name = "data" -> null

-           efs_volume_configuration {
-               file_system_id          = "fs-08f95063c1cdbe191" -> null
-               root_directory          = "/" -> null
-               transit_encryption      = "ENABLED" -> null
-               transit_encryption_port = 0 -> null

-               authorization_config {
-                   access_point_id = "fsap-03bc0296928aade4f" -> null
                }
            }
        }
+       volume {
+           name = "data"

+           efs_volume_configuration {
+               file_system_id     = "fs-08f95063c1cdbe191"
+               root_directory     = "/"
+               transit_encryption = "ENABLED"

+               authorization_config {
+                   access_point_id = "fsap-03bc0296928aade4f"
                }
            }
        }

        # (1 unchanged block hidden)
    }

  # module.consume_grants.aws_ecs_service.default will be updated in-place
  ~ resource "aws_ecs_service" "default" {
        id                                 = "arn:aws:ecs:us-west-2:357150818708:service/gost-staging/gost-staging-consume_grants"
        name                               = "gost-staging-consume_grants"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:357150818708:task-definition/gost-staging-consume_grants:176" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.consume_grants.aws_ecs_task_definition.consume_grants must be replaced
+/- resource "aws_ecs_task_definition" "consume_grants" {
      ~ arn                      = "arn:aws:ecs:us-west-2:357150818708:task-definition/gost-staging-consume_grants:176" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:357150818708:task-definition/gost-staging-consume_grants" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ id                       = "gost-staging-consume_grants" -> (known after apply)
-       ipc_mode                 = "" -> null
-       pid_mode                 = "" -> null
      ~ revision                 = 176 -> (known after apply)
-       tags                     = {} -> null
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.digest_email_get_grants.aws_appautoscaling_policy.sqs_scale_down_ecs_tasks will be created
+   resource "aws_appautoscaling_policy" "sqs_scale_down_ecs_tasks" {
+       alarm_arns         = (known after apply)
+       arn                = (known after apply)
+       id                 = (known after apply)
+       name               = "gost-staging-digest_get_grants-sqs-scale_down"
+       policy_type        = "StepScaling"
+       resource_id        = (known after apply)
+       scalable_dimension = "ecs:service:DesiredCount"
+       service_namespace  = "ecs"

+       step_scaling_policy_configuration {
+           adjustment_type         = "ExactCapacity"
+           metric_aggregation_type = "Average"

+           step_adjustment {
+               metric_interval_upper_bound = "0"
+               scaling_adjustment          = 0
            }
        }
    }

  # module.digest_email_get_grants.aws_appautoscaling_policy.sqs_scale_up_ecs_tasks will be created
+   resource "aws_appautoscaling_policy" "sqs_scale_up_ecs_tasks" {
+       alarm_arns         = (known after apply)
+       arn                = (known after apply)
+       id                 = (known after apply)
+       name               = "gost-staging-digest_get_grants-sqs-scale_up"
+       policy_type        = "StepScaling"
+       resource_id        = (known after apply)
+       scalable_dimension = "ecs:service:DesiredCount"
+       service_namespace  = "ecs"

+       step_scaling_policy_configuration {
+           adjustment_type         = "ExactCapacity"
+           cooldown                = 60
+           metric_aggregation_type = "Average"

+           step_adjustment {
+               metric_interval_lower_bound = "0"
+               metric_interval_upper_bound = "200"
+               scaling_adjustment          = 1
            }
+           step_adjustment {
+               metric_interval_lower_bound = "1000"
+               metric_interval_upper_bound = "2000"
+               scaling_adjustment          = 4
            }
+           step_adjustment {
+               metric_interval_lower_bound = "10000"
+               scaling_adjustment          = 7
            }
+           step_adjustment {
+               metric_interval_lower_bound = "200"
+               metric_interval_upper_bound = "500"
+               scaling_adjustment          = 2
            }
+           step_adjustment {
+               metric_interval_lower_bound = "2000"
+               metric_interval_upper_bound = "5000"
+               scaling_adjustment          = 5
            }
+           step_adjustment {
+               metric_interval_lower_bound = "500"
+               metric_interval_upper_bound = "1000"
+               scaling_adjustment          = 3
            }
+           step_adjustment {
+               metric_interval_lower_bound = "5000"
+               metric_interval_upper_bound = "10000"
+               scaling_adjustment          = 6
            }
        }
    }

  # module.digest_email_get_grants.aws_appautoscaling_target.desired_count will be created
+   resource "aws_appautoscaling_target" "desired_count" {
+       arn                = (known after apply)
+       id                 = (known after apply)
+       max_capacity       = 7
+       min_capacity       = 0
+       resource_id        = "service/gost-staging/gost-staging-digest_get_grants"
+       role_arn           = (known after apply)
+       scalable_dimension = "ecs:service:DesiredCount"
+       service_namespace  = "ecs"
+       tags_all           = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
    }

  # module.digest_email_get_grants.aws_cloudwatch_log_group.default will be created
+   resource "aws_cloudwatch_log_group" "default" {
+       arn               = (known after apply)
+       id                = (known after apply)
+       name              = (known after apply)
+       name_prefix       = "gost-staging-digest_get_grants-"
+       retention_in_days = 14
+       skip_destroy      = false
+       tags_all          = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
    }

  # module.digest_email_get_grants.aws_cloudwatch_metric_alarm.sqs-scale_down_tasks will be created
+   resource "aws_cloudwatch_metric_alarm" "sqs-scale_down_tasks" {
+       actions_enabled                       = true
+       alarm_actions                         = (known after apply)
+       alarm_description                     = "Decreases tasks based on source queue size."
+       alarm_name                            = "gost-staging-digest_get_grants-SQS-ScaleDown-Tasks"
+       arn                                   = (known after apply)
+       comparison_operator                   = "LessThanThreshold"
+       dimensions                            = (known after apply)
+       evaluate_low_sample_count_percentiles = (known after apply)
+       evaluation_periods                    = 1
+       id                                    = (known after apply)
+       metric_name                           = "ApproximateNumberOfMessagesVisible"
+       namespace                             = "AWS/SQS"
+       period                                = 60
+       statistic                             = "Sum"
+       tags_all                              = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
+       threshold                             = 1
+       treat_missing_data                    = "missing"
    }

  # module.digest_email_get_grants.aws_cloudwatch_metric_alarm.sqs_scale_up_ecs_tasks will be created
+   resource "aws_cloudwatch_metric_alarm" "sqs_scale_up_ecs_tasks" {
+       actions_enabled                       = true
+       alarm_actions                         = (known after apply)
+       alarm_description                     = "Increases tasks based on source queue size."
+       alarm_name                            = "gost-staging-digest_get_grants-SQS-ScaleUp-Tasks"
+       arn                                   = (known after apply)
+       comparison_operator                   = "GreaterThanOrEqualToThreshold"
+       dimensions                            = (known after apply)
+       evaluate_low_sample_count_percentiles = (known after apply)
+       evaluation_periods                    = 1
+       id                                    = (known after apply)
+       metric_name                           = "ApproximateNumberOfMessagesVisible"
+       namespace                             = "AWS/SQS"
+       period                                = 60
+       statistic                             = "Sum"
+       tags_all                              = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
+       threshold                             = 1
+       treat_missing_data                    = "missing"
    }

  # module.digest_email_get_grants.aws_ecs_service.default will be created
+   resource "aws_ecs_service" "default" {
+       cluster                            = "arn:aws:ecs:us-west-2:357150818708:cluster/gost-staging"
+       deployment_maximum_percent         = 200
+       deployment_minimum_healthy_percent = 100
+       desired_count                      = 0
+       enable_ecs_managed_tags            = false
+       enable_execute_command             = true
+       iam_role                           = (known after apply)
+       id                                 = (known after apply)
+       launch_type                        = "FARGATE"
+       name                               = "gost-staging-digest_get_grants"
+       platform_version                   = (known after apply)
+       scheduling_strategy                = "REPLICA"
+       tags_all                           = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
+       task_definition                    = (known after apply)
+       triggers                           = (known after apply)
+       wait_for_steady_state              = false

+       network_configuration {
+           assign_public_ip = false
+           security_groups  = (known after apply)
+           subnets          = (sensitive value)
        }
    }

  # module.digest_email_get_grants.aws_ecs_task_definition.consumer will be created
+   resource "aws_ecs_task_definition" "consumer" {
+       arn                      = (known after apply)
+       arn_without_revision     = (known after apply)
+       container_definitions    = (sensitive value)
+       cpu                      = "256"
+       execution_role_arn       = (known after apply)
+       family                   = "gost-staging-digest_get_grants"
+       id                       = (known after apply)
+       memory                   = "512"
+       network_mode             = "awsvpc"
+       requires_compatibilities = [
+           "FARGATE",
        ]
+       revision                 = (known after apply)
+       skip_destroy             = false
+       tags_all                 = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
+       task_role_arn            = (known after apply)

+       runtime_platform {
+           cpu_architecture        = "ARM64"
+           operating_system_family = "LINUX"
        }
    }

  # module.digest_email_get_grants.aws_iam_role.execution will be created
+   resource "aws_iam_role" "execution" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = (known after apply)
+       name_prefix           = "gost-staging-digest_get_grants-Exec-"
+       path                  = "/"
+       permissions_boundary  = "arn:aws:iam::357150818708:policy/service-management-boundary"
+       role_last_used        = (known after apply)
+       tags_all              = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
+       unique_id             = (known after apply)

+       inline_policy {
+           name   = (known after apply)
+           policy = (known after apply)
        }
    }

  # module.digest_email_get_grants.aws_iam_role.task will be created
+   resource "aws_iam_role" "task" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Condition = {
+                           ArnLike      = {
+                               "aws:SourceArn" = "arn:aws:ecs:us-west-2:357150818708:*"
                            }
+                           StringEquals = {
+                               "aws:SourceAccount" = "357150818708"
                            }
                        }
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = (known after apply)
+       name_prefix           = "gost-staging-digest_get_grants-Task-"
+       path                  = "/"
+       permissions_boundary  = "arn:aws:iam::357150818708:policy/service-management-boundary"
+       role_last_used        = (known after apply)
+       tags_all              = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
+       unique_id             = (known after apply)

+       inline_policy {
+           name   = (known after apply)
+           policy = (known after apply)
        }
    }

  # module.digest_email_get_grants.aws_iam_role_policy.execution["decrypt-datadog-api-key"] will be created
+   resource "aws_iam_role_policy" "execution" {
+       id     = (known after apply)
+       name   = "decrypt-datadog-api-key"
+       policy = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = "kms:Decrypt"
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:ssm:us-west-2:357150818708:parameter/gost/staging/datadog/api_key",
+                           "arn:aws:kms:us-west-2:357150818708:key/df1661b4-62e5-4668-8e39-f872c9acfceb",
                        ]
+                       Sid      = "DecryptWithKMS"
                    },
+                   {
+                       Action   = [
+                           "ssm:GetParameters",
+                           "secretsmanager:GetSecretValue",
                        ]
+                       Effect   = "Allow"
+                       Resource = "arn:aws:ssm:us-west-2:357150818708:parameter/gost/staging/datadog/api_key"
+                       Sid      = "GetSecretParameters"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       role   = (known after apply)
    }

  # module.digest_email_get_grants.aws_iam_role_policy.execution["write-logs"] will be created
+   resource "aws_iam_role_policy" "execution" {
+       id     = (known after apply)
+       name   = "write-logs"
+       policy = (known after apply)
+       role   = (known after apply)
    }

  # module.digest_email_get_grants.aws_iam_role_policy.task["connect-to-postgres"] will be created
+   resource "aws_iam_role_policy" "task" {
+       id     = (known after apply)
+       name   = "connect-to-postgres"
+       policy = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = "rds-db:connect"
+                       Effect   = "Allow"
+                       Resource = "arn:aws:rds-db:us-west-2:357150818708:dbuser:cluster-MB5CSR4GERRMATFYFNW7H6HPWY/postgres"
+                       Sid      = "DBAccess"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       role   = (known after apply)
    }

  # module.digest_email_get_grants.aws_iam_role_policy.task["consume-sqs-messages"] will be created
+   resource "aws_iam_role_policy" "task" {
+       id     = (known after apply)
+       name   = "consume-sqs-messages"
+       policy = (known after apply)
+       role   = (known after apply)
    }

  # module.digest_email_get_grants.aws_iam_role_policy.task["ecs-exec"] will be created
+   resource "aws_iam_role_policy" "task" {
+       id     = (known after apply)
+       name   = "ecs-exec"
+       policy = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = [
+                           "ssmmessages:OpenDataChannel",
+                           "ssmmessages:OpenControlChannel",
+                           "ssmmessages:CreateDataChannel",
+                           "ssmmessages:CreateControlChannel",
                        ]
+                       Effect   = "Allow"
+                       Resource = "*"
+                       Sid      = "AllowExec"
                    },
+                   {
+                       Action   = "logs:DescribeLogGroups"
+                       Effect   = "Allow"
+                       Resource = "*"
+                       Sid      = "InventoryLogGroupsForExec"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       role   = (known after apply)
    }

  # module.digest_email_get_grants.aws_iam_role_policy.task["write-logs"] will be created
+   resource "aws_iam_role_policy" "task" {
+       id     = (known after apply)
+       name   = "write-logs"
+       policy = (known after apply)
+       role   = (known after apply)
    }

  # module.digest_email_get_grants_for_criteria_security_group.aws_security_group.cbd[0] will be created
+   resource "aws_security_group" "cbd" {
+       arn                    = (known after apply)
+       description            = "Managed by Terraform"
+       egress                 = (known after apply)
+       id                     = (known after apply)
+       ingress                = (known after apply)
+       name                   = (known after apply)
+       name_prefix            = (known after apply)
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags                   = {
+           "Attributes" = "digestemailgetgrants"
+           "Name"       = "gost-staging-digestemailgetgrants"
+           "Namespace"  = "gost-staging"
        }
+       tags_all               = {
+           "Attributes" = "digestemailgetgrants"
+           "Name"       = "gost-staging-digestemailgetgrants"
+           "Namespace"  = "gost-staging"
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
+       vpc_id                 = (sensitive value)

+       timeouts {
+           create = "10m"
+           delete = "15m"
        }
    }

  # module.digest_email_get_grants_for_criteria_security_group.aws_security_group_rule.keyed["_allow_all_egress_"] will be created
+   resource "aws_security_group_rule" "keyed" {
+       cidr_blocks              = [
+           "0.0.0.0/0",
        ]
+       description              = "Allow all egress"
+       from_port                = 0
+       id                       = (known after apply)
+       ipv6_cidr_blocks         = [
+           "::/0",
        ]
+       prefix_list_ids          = []
+       protocol                 = "-1"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = false
+       source_security_group_id = (known after apply)
+       to_port                  = 0
+       type                     = "egress"
    }

  # module.digest_email_get_grants_for_criteria_security_group.null_resource.sync_rules_and_sg_lifecycles[0] will be created
+   resource "null_resource" "sync_rules_and_sg_lifecycles" {
+       id       = (known after apply)
+       triggers = {
+           "sg_ids" = (known after apply)
        }
    }

  # module.digest_email_get_grants_for_criteria_security_group.random_id.rule_change_forces_new_security_group[0] will be created
+   resource "random_id" "rule_change_forces_new_security_group" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 3
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
+       keepers     = {
+           "rules" = jsonencode(
                {
+                   _allow_all_egress_ = {
+                       cidr_blocks              = [
+                           "0.0.0.0/0",
                        ]
+                       description              = "Allow all egress"
+                       from_port                = 0
+                       ipv6_cidr_blocks         = [
+                           "::/0",
                        ]
+                       key                      = "_allow_all_egress_"
+                       prefix_list_ids          = []
+                       protocol                 = "-1"
+                       security_groups          = []
+                       self                     = null
+                       source_security_group_id = null
+                       to_port                  = 0
+                       type                     = "egress"
                    }
                }
            )
        }
    }

  # module.digest_email_send.aws_appautoscaling_policy.sqs_scale_down_ecs_tasks will be created
+   resource "aws_appautoscaling_policy" "sqs_scale_down_ecs_tasks" {
+       alarm_arns         = (known after apply)
+       arn                = (known after apply)
+       id                 = (known after apply)
+       name               = "gost-staging-digest_email_send-sqs-scale_down"
+       policy_type        = "StepScaling"
+       resource_id        = (known after apply)
+       scalable_dimension = "ecs:service:DesiredCount"
+       service_namespace  = "ecs"

+       step_scaling_policy_configuration {
+           adjustment_type         = "ExactCapacity"
+           metric_aggregation_type = "Average"

+           step_adjustment {
+               metric_interval_upper_bound = "0"
+               scaling_adjustment          = 0
            }
        }
    }

  # module.digest_email_send.aws_appautoscaling_policy.sqs_scale_up_ecs_tasks will be created
+   resource "aws_appautoscaling_policy" "sqs_scale_up_ecs_tasks" {
+       alarm_arns         = (known after apply)
+       arn                = (known after apply)
+       id                 = (known after apply)
+       name               = "gost-staging-digest_email_send-sqs-scale_up"
+       policy_type        = "StepScaling"
+       resource_id        = (known after apply)
+       scalable_dimension = "ecs:service:DesiredCount"
+       service_namespace  = "ecs"

+       step_scaling_policy_configuration {
+           adjustment_type         = "ExactCapacity"
+           cooldown                = 60
+           metric_aggregation_type = "Average"

+           step_adjustment {
+               metric_interval_lower_bound = "0"
+               metric_interval_upper_bound = "100"
+               scaling_adjustment          = 1
            }
+           step_adjustment {
+               metric_interval_lower_bound = "100"
+               metric_interval_upper_bound = "200"
+               scaling_adjustment          = 2
            }
+           step_adjustment {
+               metric_interval_lower_bound = "1000"
+               metric_interval_upper_bound = "5000"
+               scaling_adjustment          = 7
            }
+           step_adjustment {
+               metric_interval_lower_bound = "10000"
+               scaling_adjustment          = 9
            }
+           step_adjustment {
+               metric_interval_lower_bound = "200"
+               metric_interval_upper_bound = "400"
+               scaling_adjustment          = 3
            }
+           step_adjustment {
+               metric_interval_lower_bound = "400"
+               metric_interval_upper_bound = "600"
+               scaling_adjustment          = 4
            }
+           step_adjustment {
+               metric_interval_lower_bound = "5000"
+               metric_interval_upper_bound = "10000"
+               scaling_adjustment          = 8
            }
+           step_adjustment {
+               metric_interval_lower_bound = "600"
+               metric_interval_upper_bound = "800"
+               scaling_adjustment          = 5
            }
+           step_adjustment {
+               metric_interval_lower_bound = "800"
+               metric_interval_upper_bound = "1000"
+               scaling_adjustment          = 6
            }
        }
    }

  # module.digest_email_send.aws_appautoscaling_target.desired_count will be created
+   resource "aws_appautoscaling_target" "desired_count" {
+       arn                = (known after apply)
+       id                 = (known after apply)
+       max_capacity       = 9
+       min_capacity       = 0
+       resource_id        = "service/gost-staging/gost-staging-digest_email_send"
+       role_arn           = (known after apply)
+       scalable_dimension = "ecs:service:DesiredCount"
+       service_namespace  = "ecs"
+       tags_all           = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
    }

  # module.digest_email_send.aws_cloudwatch_log_group.default will be created
+   resource "aws_cloudwatch_log_group" "default" {
+       arn               = (known after apply)
+       id                = (known after apply)
+       name              = (known after apply)
+       name_prefix       = "gost-staging-digest_email_send-"
+       retention_in_days = 14
+       skip_destroy      = false
+       tags_all          = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
    }

  # module.digest_email_send.aws_cloudwatch_metric_alarm.sqs-scale_down_tasks will be created
+   resource "aws_cloudwatch_metric_alarm" "sqs-scale_down_tasks" {
+       actions_enabled                       = true
+       alarm_actions                         = (known after apply)
+       alarm_description                     = "Decreases tasks based on source queue size."
+       alarm_name                            = "gost-staging-digest_email_send-SQS-ScaleDown-Tasks"
+       arn                                   = (known after apply)
+       comparison_operator                   = "LessThanThreshold"
+       dimensions                            = (known after apply)
+       evaluate_low_sample_count_percentiles = (known after apply)
+       evaluation_periods                    = 1
+       id                                    = (known after apply)
+       metric_name                           = "ApproximateNumberOfMessagesVisible"
+       namespace                             = "AWS/SQS"
+       period                                = 60
+       statistic                             = "Sum"
+       tags_all                              = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
+       threshold                             = 1
+       treat_missing_data                    = "missing"
    }

  # module.digest_email_send.aws_cloudwatch_metric_alarm.sqs_scale_up_ecs_tasks will be created
+   resource "aws_cloudwatch_metric_alarm" "sqs_scale_up_ecs_tasks" {
+       actions_enabled                       = true
+       alarm_actions                         = (known after apply)
+       alarm_description                     = "Increases tasks based on source queue size."
+       alarm_name                            = "gost-staging-digest_email_send-SQS-ScaleUp-Tasks"
+       arn                                   = (known after apply)
+       comparison_operator                   = "GreaterThanOrEqualToThreshold"
+       dimensions                            = (known after apply)
+       evaluate_low_sample_count_percentiles = (known after apply)
+       evaluation_periods                    = 1
+       id                                    = (known after apply)
+       metric_name                           = "ApproximateNumberOfMessagesVisible"
+       namespace                             = "AWS/SQS"
+       period                                = 60
+       statistic                             = "Sum"
+       tags_all                              = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
+       threshold                             = 1
+       treat_missing_data                    = "missing"
    }

  # module.digest_email_send.aws_ecs_service.default will be created
+   resource "aws_ecs_service" "default" {
+       cluster                            = "arn:aws:ecs:us-west-2:357150818708:cluster/gost-staging"
+       deployment_maximum_percent         = 200
+       deployment_minimum_healthy_percent = 100
+       desired_count                      = 0
+       enable_ecs_managed_tags            = false
+       enable_execute_command             = true
+       iam_role                           = (known after apply)
+       id                                 = (known after apply)
+       launch_type                        = "FARGATE"
+       name                               = "gost-staging-digest_email_send"
+       platform_version                   = (known after apply)
+       scheduling_strategy                = "REPLICA"
+       tags_all                           = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
+       task_definition                    = (known after apply)
+       triggers                           = (known after apply)
+       wait_for_steady_state              = false

+       network_configuration {
+           assign_public_ip = false
+           security_groups  = (known after apply)
+           subnets          = (sensitive value)
        }
    }

  # module.digest_email_send.aws_ecs_task_definition.consumer will be created
+   resource "aws_ecs_task_definition" "consumer" {
+       arn                      = (known after apply)
+       arn_without_revision     = (known after apply)
+       container_definitions    = (sensitive value)
+       cpu                      = "256"
+       execution_role_arn       = (known after apply)
+       family                   = "gost-staging-digest_email_send"
+       id                       = (known after apply)
+       memory                   = "512"
+       network_mode             = "awsvpc"
+       requires_compatibilities = [
+           "FARGATE",
        ]
+       revision                 = (known after apply)
+       skip_destroy             = false
+       tags_all                 = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
+       task_role_arn            = (known after apply)

+       runtime_platform {
+           cpu_architecture        = "ARM64"
+           operating_system_family = "LINUX"
        }
    }

  # module.digest_email_send.aws_iam_role.execution will be created
+   resource "aws_iam_role" "execution" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = (known after apply)
+       name_prefix           = "gost-staging-digest_email_send-Exec-"
+       path                  = "/"
+       permissions_boundary  = "arn:aws:iam::357150818708:policy/service-management-boundary"
+       role_last_used        = (known after apply)
+       tags_all              = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
+       unique_id             = (known after apply)

+       inline_policy {
+           name   = (known after apply)
+           policy = (known after apply)
        }
    }

  # module.digest_email_send.aws_iam_role.task will be created
+   resource "aws_iam_role" "task" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Condition = {
+                           ArnLike      = {
+                               "aws:SourceArn" = "arn:aws:ecs:us-west-2:357150818708:*"
                            }
+                           StringEquals = {
+                               "aws:SourceAccount" = "357150818708"
                            }
                        }
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = (known after apply)
+       name_prefix           = "gost-staging-digest_email_send-Task-"
+       path                  = "/"
+       permissions_boundary  = "arn:aws:iam::357150818708:policy/service-management-boundary"
+       role_last_used        = (known after apply)
+       tags_all              = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
+       unique_id             = (known after apply)

+       inline_policy {
+           name   = (known after apply)
+           policy = (known after apply)
        }
    }

  # module.digest_email_send.aws_iam_role_policy.execution["decrypt-datadog-api-key"] will be created
+   resource "aws_iam_role_policy" "execution" {
+       id     = (known after apply)
+       name   = "decrypt-datadog-api-key"
+       policy = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = "kms:Decrypt"
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:ssm:us-west-2:357150818708:parameter/gost/staging/datadog/api_key",
+                           "arn:aws:kms:us-west-2:357150818708:key/df1661b4-62e5-4668-8e39-f872c9acfceb",
                        ]
+                       Sid      = "DecryptWithKMS"
                    },
+                   {
+                       Action   = [
+                           "ssm:GetParameters",
+                           "secretsmanager:GetSecretValue",
                        ]
+                       Effect   = "Allow"
+                       Resource = "arn:aws:ssm:us-west-2:357150818708:parameter/gost/staging/datadog/api_key"
+                       Sid      = "GetSecretParameters"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       role   = (known after apply)
    }

  # module.digest_email_send.aws_iam_role_policy.execution["write-logs"] will be created
+   resource "aws_iam_role_policy" "execution" {
+       id     = (known after apply)
+       name   = "write-logs"
+       policy = (known after apply)
+       role   = (known after apply)
    }

  # module.digest_email_send.aws_iam_role_policy.task["connect-to-postgres"] will be created
+   resource "aws_iam_role_policy" "task" {
+       id     = (known after apply)
+       name   = "connect-to-postgres"
+       policy = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = "rds-db:connect"
+                       Effect   = "Allow"
+                       Resource = "arn:aws:rds-db:us-west-2:357150818708:dbuser:cluster-MB5CSR4GERRMATFYFNW7H6HPWY/postgres"
+                       Sid      = "DBAccess"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       role   = (known after apply)
    }

  # module.digest_email_send.aws_iam_role_policy.task["consume-sqs-messages"] will be created
+   resource "aws_iam_role_policy" "task" {
+       id     = (known after apply)
+       name   = "consume-sqs-messages"
+       policy = (known after apply)
+       role   = (known after apply)
    }

  # module.digest_email_send.aws_iam_role_policy.task["ecs-exec"] will be created
+   resource "aws_iam_role_policy" "task" {
+       id     = (known after apply)
+       name   = "ecs-exec"
+       policy = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = [
+                           "ssmmessages:OpenDataChannel",
+                           "ssmmessages:OpenControlChannel",
+                           "ssmmessages:CreateDataChannel",
+                           "ssmmessages:CreateControlChannel",
                        ]
+                       Effect   = "Allow"
+                       Resource = "*"
+                       Sid      = "AllowExec"
                    },
+                   {
+                       Action   = "logs:DescribeLogGroups"
+                       Effect   = "Allow"
+                       Resource = "*"
+                       Sid      = "InventoryLogGroupsForExec"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       role   = (known after apply)
    }

  # module.digest_email_send.aws_iam_role_policy.task["send-emails"] will be created
+   resource "aws_iam_role_policy" "task" {
+       id     = (known after apply)
+       name   = "send-emails"
+       policy = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = [
+                           "SES:SendRawEmail",
+                           "SES:SendEmail",
                        ]
+                       Condition = {
+                           StringLike = {
+                               "ses:FromAddress" = [
+                                   "grants-notifications@staging.grants.usdr.dev",
                                ]
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "arn:aws:ses:us-west-2:357150818708:identity/staging.grants.usdr.dev"
+                       Sid       = "SendEmails"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       role   = (known after apply)
    }

  # module.digest_email_send.aws_iam_role_policy.task["write-logs"] will be created
+   resource "aws_iam_role_policy" "task" {
+       id     = (known after apply)
+       name   = "write-logs"
+       policy = (known after apply)
+       role   = (known after apply)
    }

  # module.digest_email_send_security_group.aws_security_group.cbd[0] will be created
+   resource "aws_security_group" "cbd" {
+       arn                    = (known after apply)
+       description            = "Managed by Terraform"
+       egress                 = (known after apply)
+       id                     = (known after apply)
+       ingress                = (known after apply)
+       name                   = (known after apply)
+       name_prefix            = (known after apply)
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags                   = {
+           "Attributes" = "digestemailsend"
+           "Name"       = "gost-staging-digestemailsend"
+           "Namespace"  = "gost-staging"
        }
+       tags_all               = {
+           "Attributes" = "digestemailsend"
+           "Name"       = "gost-staging-digestemailsend"
+           "Namespace"  = "gost-staging"
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
+       vpc_id                 = (sensitive value)

+       timeouts {
+           create = "10m"
+           delete = "15m"
        }
    }

  # module.digest_email_send_security_group.aws_security_group_rule.keyed["_allow_all_egress_"] will be created
+   resource "aws_security_group_rule" "keyed" {
+       cidr_blocks              = [
+           "0.0.0.0/0",
        ]
+       description              = "Allow all egress"
+       from_port                = 0
+       id                       = (known after apply)
+       ipv6_cidr_blocks         = [
+           "::/0",
        ]
+       prefix_list_ids          = []
+       protocol                 = "-1"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = false
+       source_security_group_id = (known after apply)
+       to_port                  = 0
+       type                     = "egress"
    }

  # module.digest_email_send_security_group.null_resource.sync_rules_and_sg_lifecycles[0] will be created
+   resource "null_resource" "sync_rules_and_sg_lifecycles" {
+       id       = (known after apply)
+       triggers = {
+           "sg_ids" = (known after apply)
        }
    }

  # module.digest_email_send_security_group.random_id.rule_change_forces_new_security_group[0] will be created
+   resource "random_id" "rule_change_forces_new_security_group" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 3
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
+       keepers     = {
+           "rules" = jsonencode(
                {
+                   _allow_all_egress_ = {
+                       cidr_blocks              = [
+                           "0.0.0.0/0",
                        ]
+                       description              = "Allow all egress"
+                       from_port                = 0
+                       ipv6_cidr_blocks         = [
+                           "::/0",
                        ]
+                       key                      = "_allow_all_egress_"
+                       prefix_list_ids          = []
+                       protocol                 = "-1"
+                       security_groups          = []
+                       self                     = null
+                       source_security_group_id = null
+                       to_port                  = 0
+                       type                     = "egress"
                    }
                }
            )
        }
    }

  # module.website.aws_s3_object.deploy-config[0] will be updated in-place
  ~ resource "aws_s3_object" "deploy-config" {
      ~ content                = <<-EOT
            window.APP_CONFIG = window.APP_CONFIG || {};
            window.APP_CONFIG.apiURLForGOST = 'https://api.staging.grants.usdr.dev/';
            window.apiURLForGOST = window.APP_CONFIG.apiURLForGOST; // Legacy
            
            window.APP_CONFIG.DD_RUM_ENABLED = true;
-           window.APP_CONFIG.DD_RUM_CONFIG = {"allowedTracingUrls":["https://api.staging.grants.usdr.dev"],"applicationId":"15db471e-2ccb-4d3c-a6bf-99b750d748f5","clientToken":"pub50834fcc1999d53e546519b1a0f03934","defaultPrivacyLevel":"mask","env":"staging","service":"gost","sessionReplaySampleRate":1,"sessionSampleRate":10,"site":"datadoghq.com","trackLongTasks":true,"trackResources":true,"trackUserInteractions":true,"version":"1ed9b2c9eefa3d91508bdb7c11d1d85396394ff3"};
+           window.APP_CONFIG.DD_RUM_CONFIG = {"allowedTracingUrls":["https://api.staging.grants.usdr.dev"],"applicationId":"15db471e-2ccb-4d3c-a6bf-99b750d748f5","clientToken":"pub50834fcc1999d53e546519b1a0f03934","defaultPrivacyLevel":"mask","env":"staging","service":"gost","sessionReplaySampleRate":1,"sessionSampleRate":10,"site":"datadoghq.com","trackLongTasks":true,"trackResources":true,"trackUserInteractions":true,"version":"ff416731f461a59136b2e4cb261e0506b7b1c168"};
            
            window.APP_CONFIG.GOOGLE_TAG_ID = 'G-D5DFR7BN0N';
            
            window.APP_CONFIG.featureFlags = {"myProfileEnabled":true,"newGrantsDetailPageEnabled":true,"newTerminologyEnabled":true};
            
            window.APP_CONFIG.overrideFeatureFlag = (flagName, overrideValue) => {
              const storageKey = 'featureFlags';
              let overrides = {};
              try {
                overrides = JSON.parse(window.sessionStorage.getItem(storageKey)) || {};
              } catch (e) {
                console.error(`Error parsing window.sessionStorage.${storageKey} as JSON:`, e);
                console.warn(`window.sessionStorage.${storageKey} will be replaced.`);
              }
              overrides[flagName] = overrideValue;
              window.sessionStorage.setItem(storageKey, JSON.stringify(overrides));
              console.log('New feature flag overrides in page session:',
                window.sessionStorage.getItem(storageKey));
            };
        EOT
      ~ etag                   = "9c4f127e4fec0380958f9b8417a40cc7" -> "8ee286de1447283cc64b2bd97cac60cf"
        id                     = "/config/deploy-config.js"
        tags                   = {}
      ~ version_id             = "V2WYwgfX_jXws2HYzDedjTjWa1z.7pSR" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.website.aws_s3_object.origin_dist_artifact["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "ccd301c55153335fdb5cadba1bea3663" -> "2f2c8719cf8558607e9b1de3b8e3853a"
        id                     = "dist/index.html"
      ~ source_hash            = "ccd301c55153335fdb5cadba1bea3663" -> "2f2c8719cf8558607e9b1de3b8e3853a"
        tags                   = {}
      ~ version_id             = "BN.LzSTS.w67dhe6I1O3BCWNFjDEi8bG" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.website.aws_s3_object.origin_dist_artifact["js/319.49e3ffcb.js"] will be destroyed
  # (because key ["js/319.49e3ffcb.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       acl                    = "private" -> null
-       bucket                 = "gost-staging-origin-357150818708-us-west-2-website" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "845bddaaf6f3a797c11c290bf58eb486" -> null
-       force_destroy          = false -> null
-       id                     = "dist/js/319.49e3ffcb.js" -> null
-       key                    = "dist/js/319.49e3ffcb.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/usdr-gost/usdr-gost/...*[Comment body truncated]*